       01  INVENT-RECORD-IN.
           05  PART-NUMBER-IN      PIC 9(05).
           05  PART-NAME-IN        PIC X(20).
           05  QUANTITY-IN         PIC 9(03).
           05  UNIT-PRICE-IN       PIC 9(04)V99.
           05  REORDER-POINT-IN    PIC 9(03).
           05  SUPPLIER-ID-IN      PIC X(02).
